run/Axial_Mixer_MRFCHT_SteadyState/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// thermoType      ePsiThermo<pureMixture<constTransport<specieThermo<eConstThermo<perfectGas>>>>>;
// mixture         air 1 28.9 717.5 0 1.8e-05 0.7;

// thermoType      hPsiThermo<pureMixture<constTransport<specieThermo<hConstThermo<perfectGas>>>>>;
// // name, nMoles, mol weight, CP, Hf, mu, Pr;
// mixture         air 1 28.9 1004.5 0 1.8e-05 0.7;
// // mixture         air 1 28.9 1004.5 0 0 0.7;

// Alternative Model
thermoType      hPsiThermo<pureMixture<sutherlandTransport<specieThermo<hConstThermo<perfectGas>>>>>;
mixture             // keyword
air 1 28.9          // specie, molar mass
    1004.5 0.0      // hConstThermo - c_p and Hf (heat of fusion)
//     1.4792e-06 116;  // sutherlandTransport (Star-CD)
    1.0515712281065748e-06 110;  // sutherlandTransport (numeca) As = mu_{inf}*(1+T_s/T_{inf})/sqrt(T_{inf}), with T_s = 110K, T_{inf} = 293K and mu_{inf}=1.8e-5 Pa*s

// ************************************************************************* //
