run/Axial_Mixer_MRFCHT_SteadyState/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 12.5;

boundaryField
{

    inletRotor
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.05;
        value           uniform 12.5;
    }
    cyclic1
    {
        type            cyclicGgi;
    }
    cyclic2
    {
        type            cyclicGgi;
    }
    heat_transfer
    {
        type            compressible::kqRWallFunction;
        value           uniform  12.5;
    }
    shroud
    {
        type            compressible::kqRWallFunction;
        value           uniform  12.5;
    }
    cyclicStator1
    {
        type            cyclicGgi;
    }
    cyclicStator2
    {
        type            cyclicGgi;

    }
    outletRotor_ggi
    {
        type            ggi;
    }
    inletStator_ggi
    {
        type            ggi;
    }
    outlet
    {
        type            zeroGradient;
    }
    wall
    {
        type            compressible::kqRWallFunction;
        value           uniform  12.5;
    }
}

// ************************************************************************* //
